# ContainsKey Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..ContainsKey Method
ExportLayerTable Class See Also
---
Checks whether a layer key exists in the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ContainsKey(
	ExportLayerKey exportlayerKey
)
```

Visual Basic
---
```text
Public Function ContainsKey ( _
	exportlayerKey As ExportLayerKey _
) As Boolean
```

Visual C++
---
```text
public:
bool ContainsKey(
	ExportLayerKey^ exportlayerKey
)
```

# ### Parameters
exportlayerKey
    Type: Autodesk.Revit.DB..::..ExportLayerKey The export layer Key.
# ### Return Value
True if the layer key exists in the table.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace